Revit 2027 API
FamilySymbol.Activate Method
 Activates the symbol to ensure that its geometry is accessible.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Activate()
Public Sub Activate
public:
void Activate()
member Activate : unit -> unit
Remarks
 Symbols that are not used in the document may be deactivated to conserve memory and regeneration time. When the symbol is inactive, its geometry is empty and should not be accessed. In order to access geometry of a symbol that is not active in the document, first check its IsActive property. Note that until the document is regenerated, the newly activated symbol's geometry will still be empty.
See Also
Reference
FamilySymbol Class
Autodesk.Revit.DB Namespace